app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Gabriel"], ["last_name", "Hicks"], ["created_at", "2020-09-15 21:05:51.920698"], ["updated_at", "2020-09-15 21:05:51.920698"]]
---
  def create
    @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hcksk"], ["updated_at", "2020-09-15 21:06:04.738052"], ["id", 3]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])